/*
* 单一职责原则是什么意思?
* 对于一个类而言，应该仅有一个引起它变化的原因
*
* 如果一个类承担的职责过多，就等于把这些职责耦合在一起，一个职责的变化可能会消弱或者抑制这个类完成
* 其他职责的能力。这种耦合会导致脆弱的设计，当变化发生时，设计会遭受到意想不到的破坏。
*
* 软件设计真正要做的愈多内容，就是发现职责并把哪些职责相互分离，
* 如果你能够想到多余一个动机去改变这一个类，那么这个类就具有多于一个的职责，就应该考虑类的职责分离。
* */

public class Main {
    public static void main(String[] argv){
        /*
         * 单一职责原则是什么意思?
         * 对于一个类而言，应该仅有一个引起它变化的原因
         *
         * 如果一个类承担的职责过多，就等于把这些职责耦合在一起，一个职责的变化可能会消弱或者抑制这个类完成
         * 其他职责的能力。这种耦合会导致脆弱的设计，当变化发生时，设计会遭受到意想不到的破坏。
         *
         * 软件设计真正要做的愈多内容，就是发现职责并把哪些职责相互分离，
         * 如果你能够想到多余一个动机去改变这一个类，那么这个类就具有多于一个的职责，就应该考虑类的职责分离。
         * */
    }
}
